/* 
Інструкція (Statement): Це команда або інструкція, яку виконує JavaScript. Інструкції включають у себе такі речі, як присвоєння значень змінним, виклик функцій, умовні оператори, цикли і т. д. Приклади інструкцій: 
*/

let x = 5; // присвоєння
console.log(x); // виклик функції
if (x === 5) 0; // умовний оператор

// =======================================

/* 
Вираз (Expression): Це будь-яке дійсне значення в JavaScript. Вираз може бути змінною, літералом, викликом функції, операцією і т. д. Якщо вираз може бути обчислений, то він вважається виразом. Приклади виразів:
*/

5 + 3;
'Hello, ' + 'world!';
x;

// ========================================

/* 
Літерал (Literal): Це конкретне значення, записане безпосередньо в коді програми. Наприклад, літерали можуть бути числами, рядками, булевими значеннями, масивами, об'єктами і т. д. Літерали використовуються для представлення даних у коді. Приклади літералів:
*/

5; // числовий літерал
('Hello, world!'); // рядковий літерал
true[(1, 2, 3)]; // булевий літерал // масивовий літерал
x = { name: 'John', age: 30 }; // об'єктовий літерал
// ========================================
