/*
 * Напиши скрипт перевірки підписки користувача придоступі до контента
 * - Є три типа підписки: free, pro і vip.
 * - Отримати доступ можуть тільки користувачі pro і vip
 */

const sub = 'free';

/*
 * Напиши скрипт, який перевіряє можливість відкрити чат з користувачем.
 * Для цього, користувач має бути:
 * - другом
 * - онлайн
 * - без режима не турбувати
 */

const isOnline = true;
const isFriend = true;
const isDnd = true;

// const canOpenChat = ;
// console.log("Можно открыть чат? ", canOpenChat);

// ====================================================

/*
 * Напиши скрипт, який перевіряє введене користувачем ім'я.
 * Якщо введене значення порожне то виведи рядок "Hello Anonym"
 * Інакше привітай користувача повідомленням "Hello (NAME)"
 */

const name = 'Vasya';
