/*
 * Метод window.setTimeout(callback, delay, args)
 */

//!===============================================================

//!===================================================

// console.log('До виклику setTimeout');

// console.log('1 - Всередині зворотного виклику для setTimeout');

// console.log('2 - Всередині зворотного виклику для setTimeout');

// console.log('Після виклику setTimeout');

/*
 * Очищення таймаута за допомогою clearTimeout(timeoutId)
 */

/**
 * Можливість передати параметри для колбеку
 */
